Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །གནས་མེད་ཕ་རོལ་ཕྱིན་པ་ཐམས་ཅད་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering three hundred thirty million “Nonabiding ones of universal perfection.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ཉིས་སྟོང་ཡིན། །
en: The lifespan of humans will be two thousand years,

source: རྒལ་བར་གྱུར་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And after this teacher has gone beyond His sacred Dharma will remain for thirty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ། །
en: “The relics of this victor will be abundant, And there will be three billion fine stūpas.

source: སངས་རྒྱས་ཐུབ་པ་མེད་པའི་ཚོགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཚན་གྱིས་བརྒྱན་ཅེས་བྱ། །
en: The buddha Ajitagaṇa Will be born in a place called Adorned with Marks.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དོན་ཡོད་ཡིན། །གྲགས་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victorious one will be brahmin, And his light will extend one hundred leagues. Meaningful will be his father and Endowed with Fame his mother.

source: སྲས་པོ་ཟླ་བཟངས་བདེན་པ་རིམ་གྲོ་པ། །
en: Excellent Moon will be his son and Truth his attendant.

source: སྟོབས་ཀྱིས་འགྲོ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Powerful Movement will be the scholar

source: རྣམ་པར་འཕྲུལ་པའི་གཟི་བརྗིད་རྫུ་འཕྲུལ་ཅན། །
en: And Splendid Miraculous Display the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཞི་ཁྲི་ཀུན་ལ་ཡང་། །སྲིད་པའི་འཆིང་ལས་གྲོལ་བ་ཐམས་ཅད་པོ། །དྲང་སྲོང་ཆེ་སྲས་བྱེ་བ་བྱེ་བ་ཡོད། །
en: There will be forty thousand consecutive congregations, Each of them gathering ten million children of the great sage, “Who are all liberated from the bonds of existence.

source: མི་རྣམས་ཚེ་ཚད་ལོ་གྲངས་བཞི་ཁྲི་ཡིན། །
en: The lifespan of humans will be forty thousand years,

source: འཇིག་རྟེན་བླ་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: And after the world’s superior has attained nirvāṇa His sacred Dharma will remain for eighty thousand years.

source: སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་མཆོད་རྟེན་གྲངས། །བྱེ་བ་བརྒྱ་ཕྲག་དགུ་ཡོད་གསེར་གྱིས་སྤྲས། །
en: “The relics of this victor will be abundant, And there will be nine billion golden stūpas.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་བཤེས་གཉེན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་འཕགས་ཞེས་བྱ། །
en: The thus-gone Yaśomitra Will be born in a place called Superior Fame.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་དགུ་ཡོད་སྦྱིན་སྲེག་འོད་འཕྲོ་ཡབ། །བསོད་ནམས་ཅན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend ninety million leagues. Radiant Sacrifice will be his father and Endowed with Merit his mother.

source: སྲས་པོ་དྲང་སྲོང་ཁྱད་འཕགས་རིམ་གྲོ་པ། །
en: Sage will be his son and Distinguished his attendant.

source: ཡོན་ཏན་བདེན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “True Qualities will be the scholar

source: འཇིགས་མེད་བློ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་བདུད་དཔུང་བརླག་མཐར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering three hundred forty million liberators “Who destroy the hordes of the māras.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་ཡིན། །
en: The lifespan of humans will be twenty-one thousand years,

source: མཚུངས་པ་མེད་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And this incomparable one’s sacred Dharma Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་བདུན་ཅུ་དྲུག །
en: “The relics of this victor will be abundant, And there will be seven hundred sixty million fine stūpas.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པ་ཞེས་བྱ་བའི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཛེས་ཞེས་བྱ། །
en: The thus-gone Satya Will be born in a place called Splendid Beauty.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་བཅུ་ཡོད་མི་ཡི་དབང་པོ་ཡབ། །སྐལ་འདོད་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །སྐར་མཁན་མཆོད་སྦྱིན་བཟང་པོ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend one hundred million leagues. Lord of Humans will be his father and Fortunate Wish his mother. Astrologer will be his son and Excellent Sacrifice his attendant.

source: སྙན་པར་གྲགས་ཞེས་བྱ་བ་ཤེས་ཅན་ཏེ། །
en: “Fame will be the knowledgeable one

source: འདུས་པ་ལན་གྲངས་བྱེ་སྟོང་ཀུན་ལ་ཡང་། །དྲི་གསུམ་དྲི་མ་ཀུན་བྲལ་དགྲ་བཅོམ་པ། །བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་བདུན་ཅུ་ཡོད། །
en: There will be ten billion consecutive congregations, Each of them gathering seventy billion worthy ones “Who are free from the three stains, utterly immaculate.

source: སྐུ་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་ཚང་བ་ཡིན། །
en: His lifespan will be thirty thousand years,

source: རྒྱལ་བ་ཞི་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And when this victor has entered peace His sacred Dharma will remain for nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །དཔག་ཚད་དགུ་པ་རིན་ཆེན་བརྒྱ་ཡིས་སྤྲས། །
en: “The relics of this victor will remain in a single collection, And there will be one stūpa, measuring nine league and studded with hundreds of jewels.

source: བདེ་བར་གཤེགས་པ་དཀའ་ཐུབ་ཆེན་པོ་ཡི། །སྐྱེ་ཡུལ་མགོན་མེད་ཚིམ་པར་བྱེད་ཅེས་བྱ། །
en: The well-gone Mahātapas Will be born in a place called Satisfying the Unprotected.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་འོད་ཟེར་བཟང་། །དགའ་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Excellent Light Rays will be his father and Possessor of Joy his mother.

source: སྲས་པོ་འཇིགས་མེད་གྲགས་པ་རིམ་གྲོ་པ། །
en: Fearless will be his son and Fame his attendant.

source: རྣམ་པར་སྣང་བྱེད་གྲགས་པ་ཤེས་ཅན་ཏེ། །
en: “Famed Illuminator will be the knowledgeable one

source: ལྷུན་པོ་སྒུལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Mountain Shaker the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཏེ་ཀུན་ལ་ཡང་། །མངོན་ཤེས་དྲུག་ལྡན་གཏི་མུག་མེད་གྱུར་པ། །བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be seven consecutive congregations, Each of them gathering seventy-three billion “Possessors of the six superknowledges, who are free from ignorance.

source: ཕུང་པོ་སྤངས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་འབུམ་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of the one who has relinquished the aggregates Will remain for nine hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་ཀྱང་ཡོད།། །།
en: “The relics of this victor will abundant And the fine stūpas will number two hundred twenty million.

source: རྡུལ་དང་བྲལ་བའི་ལྷུན་པོའི་འོད་ཟེར་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་འཕགས་ཞེས་བྱ། །
en: The immaculate Meruraśmi Will be born in a place called Superior World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལེགས་བྱིན་ཡིན། །ཀུན་ཏུ་བལྟ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend one hundred leagues. Gift of Excellence will be his father and Looking will be this victorious one’s mother.

source: སྲས་པོ་ལེགས་མཆོད་རྣམ་གྲོལ་རིམ་གྲོ་པ། །
en: Excellent Worship will be his son and Liberation his attendant.

source: ཤེས་རབ་ཡོན་ཏན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Qualities of Insight will be the scholar

source: སྒྲོགས་པའི་བཤེས་གཉེན་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Proclaiming Friend the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྨྲ་མཚུངས་ལུས་པ་མེད་པར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million “Whose teachings are the same and who have reached completion.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བདུན་ཅུར་གནས། །
en: And after the victorious one has attained nirvāṇa His sacred Dharma will remain for seventy years.

source: སྐུ་གདུང་མཆོད་རྟེན་བཟང་པོ་སྟོང་དུ་ཚང་། །རིན་ཆེན་རྒྱལ་མཚན་ཡིད་དུ་འོང་བས་བརྒྱན། །
en: “His relics will be contained in one thousand fine stūpas Adorned with jewels and beautiful banners.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བརྩེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་འཕགས་ཞེས་བྱ། །
en: The thus-gone one Guṇakūṭa Will be born in a place called Superior Awakening.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་གསུམ་ཡོད་བདག་ཉིད་ཕྱུག་པོ་ཡབ། །ཡོན་ཏན་དགའ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend seventy-three leagues. Wealthy Being will be his father and Delighting in Qualities his mother.

source: སྲས་པོ་རྣམ་སྒྲོགས་དོན་ལྡན་རིམ་གྲོ་པ། །
en: Proclaimer will be his son and Meaningful his attendant.

source: རབ་ཏུ་བརྒྱན་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Adorned will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ཁམས་གསུམ་སྤོང་བར་བྱེད་པ་བསམ་གཏན་པ། །དགྲ་བཅོམ་པ་དག་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering one billion worthy ones, “Meditators who relinquish the three realms.

source: མི་ཡི་ཚེ་ཚད་ལོ་གྲངས་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be three thousand years,

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And after the teacher has gone to cessation His sacred Dharma will remain for three thousand years.

source: མཆོད་རྟེན་བཟང་པོའི་གྲངས་ནི་བྱེ་བ་ཕྲག །དགུ་བཅུ་རྩ་གཉིས་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: “The fine stūpas studded with jewels Will number nine hundred twenty million.

source: རྡུལ་དང་བྲལ་བ་མཆོད་པ་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་དད་ཅེས་བྱ། །
en: The immaculate Arhadyaśas Will be born in a place called Faithful World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་གསུམ་ཡོད་ཡབ་ནི་ཞིང་བཟངས་ཡིན། །ཕྱོགས་སེམས་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །བཞིན་གཙང་ཚུལ་མི་འཆོས་པ་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend seventy-three leagues. Excellent Field will be his father and Directed Mind his mother. Fine Countenance will be his son and Without Pretense his attendant.

source: དགའ་བའི་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Joyous Roar will be the scholar

source: རྣམ་པར་སེལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Purified the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ང་རྒྱལ་རྣམ་གྲོལ་ཐོབ་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million “Meditators who have attained freedom from pride.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-two thousand years,

source: རྣམ་པར་ཐར་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And after this teacher has gone to liberation His sacred Dharma will remain for thirty-two thousand years.

source: མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཉིས་པ་ཡི་གྲངས། །དྲུག་ཁྲི་དྲུག་སྟོང་གསེར་གྱི་རྒྱལ་མཚན་གང་། །
en: “Stūpas adorned with golden banners and measuring twelve leagues Will number sixty-six thousand.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་ངེས་ཞེས་བྱ། །
en: The thus-gone one Dharmakīrti Will be born in a place called Certainty.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །
en: “The family of this victor will be kṣatriya,

source: དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་དབང་པོ་ཡིན། །མི་གཡོ་བློ་གྲོས་སྐྱེད་པའི་ཡུམ་སྲས་པོ། །ར་ཧུ་ཤ་ཡིན་བློ་བཟངས་རིམ་གྲོ་པ། །
en: And his light will extend ten leagues. Lord will be his father and Immutable Intelligence his mother. Rahuśa will be his son and Excellent Mind his attendant.

source: འགྲོ་བས་མཆོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Worshiped by the World will be the scholar

source: གྲགས་པ་མཆོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Worship the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་བདུད་དཔུང་དཔུང་མེད་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering two hundred twenty million “Eradicators of the hordes of the māras.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be seventy-three thousand years,

source: འཇིག་རྟེན་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཁྲི་ཕྲག་གཅིག་གི་བར་དུ་གནས། །
en: And for the sake of benefiting the world The sacred Dharma will remain for ten thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་ཕྲག་གསུམ་འབྱུང་། །
en: “The relics of the victorious one will be abundant And there will appear thirty million fine stūpas.

source: བདེ་བར་གཤེགས་པ་སྦྱིན་པའི་འོད་དག་གི། །སྐྱེ་ཡུལ་འཇིག་རྟེན་ཤིན་ཏུ་དགའ་ཞེས་བྱ། །
en: The well-gone one Dānaprabha Will be born in a place called Ecstatic World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཅིག་བདག་ཉིད་ཆེན་པོ་ཡབ། །ཡུལ་ལ་དགའ་བ་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཆོས་ཀྱི་འབྱུང་གནས་གཟི་བརྗིད་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend eleven leagues. Great Being will be his father and Delighting in the Objects his mother. Source of Dharma will be his son and Splendor his attendant.

source: འཇིག་རྟེན་འཇིགས་མེད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless World the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་པད་མཚུངས་ལུས་པ་མེད་གྱུར་པ། །འདི་དག་ཀུན་ཀྱང་ཐེར་འབུམ་གསུམ་གསུམ་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering three billion “Lotus-like beings for whom nothing is left.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-six thousand years,

source: ཕ་རོལ་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And after this teacher has gone beyond His sacred Dharma will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །དཔག་ཚད་བརྒྱ་ཙམ་རྒྱལ་མཚན་མཆོག་གིས་གང་། །
en: “The relics of this victorious one will remain in a single collection Within a banner-studded stūpa measuring one hundred leagues.

source: དེ་བཞིན་གཤེགས་པ་གློག་ནི་འབྱིན་པ་ཡི། །སྐྱེ་ཡུལ་རྟག་ཏུ་སྣང་བར་བྱས་ཞེས་བྱ། །
en: The thus-gone one Vidyuddatta Will be born in a place called Always Illuminated.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་གསུམ་ཡོད་ཡབ་ནི་བློ་བཟངས་ཡིན། །བྱང་ཆུབ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend thirty million leagues. Excellent Mind will be his father, and Joy of Awakening will be this victor’s mother.

source: སྲས་པོ་བློ་རྫོགས་ཁྱད་འཕགས་རིམ་གྲོ་པ། །
en: Perfect Wisdom will be his son and Distinguished his attendant.

source: དགའ་བས་ལྟ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Looking with Joy will be the scholar

source: འཇིགས་མེད་སེམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ཡིད་ནི་ཡོངས་དག་དགྲ་བཅོམ་པ། །འཁོར་ནི་ཐེར་འབུམ་བདུན་ཅུ་དྲུག་དྲུག་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering seventy-six billion worthy ones “Whose minds are pure.

source: རྒྱལ་བ་ཐར་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this victor who has gone to liberation Will remain for six thousand years.

source: དཔག་ཚད་ལྔ་པའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག །
en: “His relics will remain in a single stūpa of five leagues.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པར་གསུང་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པའི་གནས་ཞེས་བྱ། །
en: The thus-gone one Satyakathin Will be born in a place called Worthy of Worship.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་ཕྲག་བཅུ་བདག་ཉིད་ཆེན་པོ་ཡབ། །མཆོད་རྟེན་གྲགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, “And his light will extend one hundred million leagues. Great Being will be his father, and Famed Stūpa will be this victor’s mother.

source: སྲས་པོ་ཆོས་མཆོག་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: Supreme Dharmawill be his son and Endowed with Dharma his attendant.

source: བདུད་འཇོམས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Māra Crusher will be the scholar

source: སྡུག་བསྔལ་སེལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Dispeller of Suffering the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །ང་མེད་ཟག་པ་མེད་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be five consecutive congregations, Each of them gathering nine hundred thirty million Undefiled meditators free from ‘I.’

source: ཆོས་ཐོབ་པ་ཡི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of this victor who has attained the Dharma Will remain for twenty-one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་ཐེར་འབུམ་ཕྲག་གསུམ་འབྱུང་། །
en: His relics will be abundant, “And there will be three billion fine stūpas.

source: འཇིག་རྟེན་དག་གི་མགོན་པོ་འཚོ་བྱེད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཐམས་ཅད་འབྱོར་ཞེས་བྱ། །
en: The protector of the world, Jīvaka, Will be born in a place called Universal Wealth.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ངོས་བཟངས་ཡིན། །དགའ་འགྲོ་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend three leagues. Fine Face will be his father, and Moving with Joy will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་བྱིན་ལུས་བཟངས་རིམ་གྲོ་པ། །
en: Royal Gift will be his son and Excellent Body his attendant.

source: སྐྱབས་མཆོག་རྒྱལ་པོ་བློ་གྲོས་ལྡན་པ་སྟེ། །
en: King of the Supreme Refuge will be the one of intelligence

source: སྐར་མཁན་མཁས་པ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Masterful Astrologer the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཏེ་ཀུན་ལ་ཡང་། །དྲང་སྲོང་གཏི་མུག་མེད་པར་ཐར་དགའ་བ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་བཞི་བཞི་ཡོད། །
en: There will be seven consecutive congregations, Each of them gathering six hundred forty million sages Who are free from ignorance and delight in liberation.

source: འཇིག་རྟེན་གསུམ་ལས་སྤགས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one above the three worlds Will remain for ninety-two thousand years.

source: མཆོད་རྟེན་བཟང་པོའི་གྲངས་ནི་ཐེར་འབུམ་ཕྲག །དགུ་བཅུ་རྩ་ལྔ་དག་ནི་འབྱུང་བར་འགྱུར། །
en: The number of excellent stūpas “Will reach ninety-five billion.

source: དེ་བཞིན་གཤེགས་པ་ན་ཚོད་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་འདོད་ཅེས་བྱ། །
en: The thus-gone Suvayas Will be born in a place called Always Desired.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །གྲགས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, “And his light will extend twenty-two leagues. Free from Suffering will be his father, and Endowed with Fame will be this victor’s mother.

source: སྲས་པོ་དགའ་ཆེན་ཟླ་བ་རིམ་གྲོ་པ། །
en: Great Joy will be his son and Moon his attendant.

source: འགྲོས་མཛེས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Beautiful Mode will be the one of intelligence

source: འཇིགས་མེད་ལྷ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Fearless Deity the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ཡིད་གཉིས་དག་དང་བྲལ་བའི་དགྲ་བཅོམ་ཀུན། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering seven hundred thirty million Worthy ones free from doubt.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ཆིག་སྟོང་ཡིན། །
en: “The lifespan of humans will be one thousand years,

source: རྒྱལ་བ་འཁྲུག་པ་མེད་པར་ཕྱིན་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་སུམ་སྟོང་བར་དུ་གནས། །
en: And after this victor has entered the immutable His sacred Dharma will remain three thousand years.

source: སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་མཆོད་རྟེན་གྲངས། །ཐེར་འབུམ་ཕྲག་གཉིས་སྐུ་གདུང་དག་གིས་བརྒྱན། །
en: His relics will be abundant, and the stūpas adorned with relics “Will number two billion.

source: བདེ་བར་གཤེགས་པ་ལེགས་པའི་ཚོགས་ཅན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་རི་ཞེས་བྱ། །
en: The well-gone Sadgaṇin Will be born in a place called Golden Mountain.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་གསུམ་ཡོད་ཡབ་ནི་ལེགས་མཆོད་ཡིན། །ཚོགས་མཁས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, “And his light will extend ninety-three leagues. Excellent Worship will be his father and Skilled in Gathering this victor’s mother.

source: སྲས་པོ་བླ་མ་སྐྱོན་མེད་རིམ་གྲོ་པ། །
en: Highest will be his son and Flawless his attendant.

source: རྣམ་པར་ལྟ་ཞེས་བྱ་བ་ཤེས་ཅན་ཏེ། །
en: Looking will be the one of knowledge

source: རྒྱ་མཚོ་བརྩེགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Ocean Mountain the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །སྲིད་པའི་སྲེད་ལ་ཆགས་པ་མེད་གྱུར་པ། །སྐྱེ་བའི་བཟློག་པ་དག་ནི་ཁྲི་ཁྲི་ཡོད། །
en: There will be five consecutive congregations, Each of them gathering ten thousand Who have become free from craving for existence and made an end to birth.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བཞི་སྟོང་ཡིན། །
en: “The lifespan of humans will be four thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དྲུག་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has accomplished exhaustion His sacred Dharma will remain for six thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་བྱེ་བ་ཉི་ཤུ་གཉིས། །རྒྱལ་མཚན་དམ་པ་བརྒྱ་སྙེད་དག་གིས་བརྒྱན། །
en: There will be two hundred twenty million stūpas of this victor, “Adorned with hundreds of fine banners.

source: རྒྱལ་བ་རྣམ་པར་ངེས་པའི་བློ་གྲོས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པར་ངེས་ཞེས་བྱ། །
en: The victor Viniścitamati Will be born in a place called Certain Worship.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅྭ་ལྔ་ཡབ་ནི་སུ་མེ་རུ། །ཡོན་ཏན་འཛིན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend fifteen leagues. Sumeru will be his father, and Holder of Qualities will be this victor’s mother.

source: སྲས་པོ་མཚན་བཟང་ལེགས་མཐོང་རིམ་གྲོ་པ། །
en: Excellent Mark will be his son and Excellent Sight his attendant.

source: མཐུ་རྩལ་བཅུ་ལྡན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Endowed with the Ten Powers will be the scholar

source: རྣམ་འཕྲུལ་ཀླུ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Nāga Display the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ལྟ་བའི་དྲ་བསལ་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་བདུན་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering seven hundred seventy million meditators Who have rid themselves of the web of views.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་བརྒྱད་ཡིན། །
en: “The lifespan of humans will be eighteen thousand years,

source: སྲིད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བདུན་སྟོང་བར་དུ་གནས། །
en: And after this teacher has accomplished exhaustion His sacred Dharma will remain for seventy-seven thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་བདུན་ཅུ་རྩ་བཞི་སྟེ། །རིན་ཆེན་དྲ་བ་ཡིད་དུ་འོང་བས་སྤྲས། །
en: There will be seventy-four stūpas of this victor, “Adorned with beautiful jewel nets.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་མཐའ་ནོར་བུའི་སྤོས། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་དད་ཅེས་བྱ། །
en: The thus-gone Bhavānta­maṇi­gandha Will be born in a place called Joyous Faith.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་དགའ་འབྱོར་ཡིན། །ཡོན་ཏན་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend ten million leagues. Joyous Wealth will be his father, and Supreme Qualities will be this victor’s mother.

source: སྲས་པོ་དགེ་ལེགས་ཕན་ལྡན་རིམ་གྲོ་པ། །
en: Excellent Virtue will be his son and Helpful his attendant.

source: བདུད་འཇོམས་པ་ནི་བློ་གྲོས་ལྡན་པ་སྟེ། །
en: Māra Crusher will be the one of intellect

source: བློ་མི་འཁྲུག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Unperturbed Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་སྟེ་ཀུན་ལ་ཡང་། །མི་འཁྲུགས་ཡིད་ལྡན་རི་དང་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་རེ་རེ་ཡོད། །
en: There will be nine consecutive congregations, Each of them gathering seven hundred million Mountain-like beings of unshakable mind.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ། །
en: “The lifespan of humans will be ten billion years,

source: དམ་ཆོས་ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་དང་། །གཞན་ཡང་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma will remain for twenty-two thousand years, Plus ninety-nine thousand further years.

source: དཔག་ཚད་ལྔ་པའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས། །གཅིག་སྟེ་རིན་ཆེན་རྒྱལ་མཚན་དྲ་བས་བརྒྱན། །
en: The single stūpa of relics will measure five leagues “And be adorned with jewels, banners, and nets.
